# SizeSeparator Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySettings..::..SizeSeparator Property
CableTraySettings Class See Also
---
The cable tray size separator string.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string SizeSeparator { get; set; }
```

Visual Basic
---
```text
Public Property SizeSeparator As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SizeSeparator {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace